###  Quantitative analysis using pynance and TaLib

#### Load stock price data into a pandas DataFrame

In [1]:
import sys
sys.path.append('..') # let python look to modules in our parant folder

In [12]:
from src.load_data import load_data

tickers = ["AAPL", "AMZN", "META", "MSFT", "NVDA","GOOG"] #list of ticker for dataset
all_data={}
# load all five datasets 
for t in tickers:
    df=load_data(t)
    all_data[t] = df

In [14]:
#see each of My data
all_data["AAPL"].head(5)

         Date     Close      High       Low      Open      Volume
0  2009-01-02  2.721686  2.730385  2.554037  2.575630   746015200
1  2009-01-05  2.836553  2.884539  2.780469  2.794266  1181608400
2  2009-01-06  2.789767  2.914229  2.770872  2.877641  1289310400
3  2009-01-07  2.729484  2.774170  2.706990  2.753477   753048800
4  2009-01-08  2.780169  2.793666  2.700393  2.712090   673500800

In [15]:
all_data["AMZN"].head(5)

         Date  Close    High     Low    Open     Volume
0  2009-01-02  2.718  2.7265  2.5535  2.5675  145928000
1  2009-01-05  2.703  2.7870  2.6515  2.7865  190196000
2  2009-01-06  2.868  2.9110  2.6875  2.7275  221602000
3  2009-01-07  2.810  2.8475  2.7675  2.8145  158854000
4  2009-01-08  2.858  2.8660  2.7290  2.7495  131558000

In [16]:
all_data['NVDA'].head(5)

         Date     Close      High       Low      Open      Volume
0  2009-01-02  0.199652  0.201027  0.184294  0.184982   497124000
1  2009-01-05  0.203319  0.207904  0.195984  0.197360   705736000
2  2009-01-06  0.210196  0.216156  0.204695  0.209279   657904000
3  2009-01-07  0.197589  0.205382  0.190483  0.205382   870096000
4  2009-01-08  0.192546  0.195067  0.180626  0.195067  1014496000

In [17]:
all_data['META'].head(5)

         Date      Close       High        Low       Open     Volume
0  2012-05-18  37.995762  44.724282  37.767172  41.792356  573576400
1  2012-05-21  33.821495  36.435382  32.797807  36.306177  168192700
2  2012-05-22  30.810066  33.384198  30.750434  32.410203  101786600
3  2012-05-23  31.803938  32.300874  31.167860  31.177799   73600000
4  2012-05-24  32.827625  33.006523  31.575347  32.748117   50237200

In [18]:
all_data['GOOG'].head(5)

         Date     Close      High       Low      Open     Volume
0  2009-01-02  7.948608  7.960977  7.557264  7.633949  144961322
1  2009-01-05  8.115089  8.194003  7.792268  7.940692  196293007
2  2009-01-06  8.263762  8.430492  8.074027  8.237046  257971329
3  2009-01-07  7.965677  8.185839  7.885034  8.121770  180453860
4  2009-01-08  8.044340  8.044340  7.850152  7.873406  144567852

#### Prepare Your Data

In [19]:
from src.pre_process import add_returns
for ticker,df in all_data.items():
   all_data[ticker]=add_returns(df)

In [20]:
# check the dataset for preprocess
all_data['AAPL'].head(5)

,Date,Close,High,Low,Open,Volume,Return,LogReturn
0,2009-01-02,2.721686,2.730385,2.554037,2.575630,746015200,NaN,NaN
1,2009-01-05,2.836553,2.884539,2.780469,2.794266,1181608400,0.042204,0.041338
2,2009-01-06,2.789767,2.914229,2.770872,2.877641,1289310400,-0.016494,-0.016632
3,2009-01-07,2.729484,2.774170,2.706990,2.753477,753048800,-0.021609,-0.021845
4,2009-01-08,2.780169,2.793666,2.700393,2.712090,673500800,0.018570,0.018399

In [23]:
all_data['GOOG'].head()

,Date,Close,High,Low,Open,Volume,Return,LogReturn
0,2009-01-02,7.948608,7.960977,7.557264,7.633949,144961322,NaN,NaN
1,2009-01-05,8.115089,8.194003,7.792268,7.940692,196293007,0.020945,0.020728
2,2009-01-06,8.263762,8.430492,8.074027,8.237046,257971329,0.018321,0.018155
3,2009-01-07,7.965677,8.185839,7.885034,8.121770,180453860,-0.036071,-0.036738
4,2009-01-08,8.044340,8.044340,7.850152,7.873406,144567852,0.009875,0.009827